In [4]:
import numpy as np
import pandas as pd

# DataFrame and Accessing data

In [5]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]
columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [6]:
# we can use list to create dataframe
df = pd.DataFrame(data)

In [7]:
df

         0         1     2      3  4          5            6      7
0   Nissan    Stanza  1991  138.0  4     MANUAL        sedan   2000
1  Hyundai    Sonata  2017    NaN  4  AUTOMATIC        Sedan  27150
2    Lotus     Elise  2010  218.0  4     MANUAL  convertible  54990
3      GMC    Acadia  2017  194.0  4  AUTOMATIC      4dr SUV  34450
4   Nissan  Frontier  2017  261.0  6     MANUAL       Pickup  32340

In [8]:
# set column name with dataframe
df = pd.DataFrame(data, columns=columns)

In [9]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [10]:
data = [
    {
        "Make": "Nissan",
        "Model": "Stanza",
        "Year": 1991,
        "Engine HP": 138.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "sedan",
        "MSRP": 2000
    },
    {
        "Make": "Hyundai",
        "Model": "Sonata",
        "Year": 2017,
        "Engine HP": None,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "Sedan",
        "MSRP": 27150
    },
    {
        "Make": "Lotus",
        "Model": "Elise",
        "Year": 2010,
        "Engine HP": 218.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "convertible",
        "MSRP": 54990
    },
    {
        "Make": "GMC",
        "Model": "Acadia",
        "Year": 2017,
        "Engine HP": 194.0,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "4dr SUV",
        "MSRP": 34450
    },
    {
        "Make": "Nissan",
        "Model": "Frontier",
        "Year": 2017,
        "Engine HP": 261.0,
        "Engine Cylinders": 6,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "Pickup",
        "MSRP": 32340
    }
]

In [11]:
# Alternatively we can use dictionary to create dataframe
df = pd.DataFrame(data)

In [12]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [13]:
# can get some small amount of data 
df.head(3)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990

In [15]:
# single column get form dataframe
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [16]:
# If a name contains spaces, we can't use dot, use square brackets
df['Engine HP']

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

In [18]:
# also use variable in square brackets
column_name = 'Transmission Type'
df[column_name]

0       MANUAL
1    AUTOMATIC
2       MANUAL
3    AUTOMATIC
4       MANUAL
Name: Transmission Type, dtype: object

In [19]:
# Use a list to select a subset of columns
df[['Make', 'MSRP', 'Year']]

      Make   MSRP  Year
0   Nissan   2000  1991
1  Hyundai  27150  2017
2    Lotus  54990  2010
3      GMC  34450  2017
4   Nissan  32340  2017

In [21]:
# add new column name test_col
df['test_col'] = ['a','b','c','d','e']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,a
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,b
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,c
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,d
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,e

In [22]:
# modify existing column data test_col
df['test_col'] = ['aa', 'bb','cc','dd','ee']

In [23]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee

In [24]:
df['id'] = [1,2,3,4,5]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee,5

In [25]:
# delete column form dataframe
del df['id']

In [26]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee

In [27]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [28]:
df.Make.index

RangeIndex(start=0, stop=5, step=1)

In [30]:
df.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP', 'test_col'],
      dtype='object')

In [31]:
df.iloc

In [32]:
# index base row data look
df.iloc[0]

Make                 Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
MSRP                   2000
test_col                 aa
Name: 0, dtype: object

In [33]:
df.iloc[2]

Make                       Lotus
Model                      Elise
Year                        2010
Engine HP                  218.0
Engine Cylinders               4
Transmission Type         MANUAL
Vehicle_Style        convertible
MSRP                       54990
test_col                      cc
Name: 2, dtype: object

In [34]:
# index base row data using list look
df.iloc[[0,3,4]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee

# Splitting Data (randomly data set into training/test data)

In [40]:
idx = np.arange(5)
idx

array([0, 1, 2, 3, 4])

In [41]:
np.random.seed(2)
np.random.shuffle(idx)
idx

array([2, 4, 1, 3, 0])

In [44]:
# get data frame using random shuffle index id
df.iloc[idx]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa

In [57]:
df = df.iloc[idx]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb

In [58]:
df.reset_index(drop=True)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb

In [51]:
train = 3
validate = 1
test = 1

In [52]:
df_train = df.iloc[:train]
df_validate = df.iloc[train:train+validate]
df_test = df.iloc[train+validate:]

In [54]:
df_test

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa

In [53]:
df_train

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb

In [55]:
df_validate

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd

In [59]:
df.Make

4     Nissan
2      Lotus
0     Nissan
3        GMC
1    Hyundai
Name: Make, dtype: object

In [60]:
df_train.Make

2      Lotus
4     Nissan
1    Hyundai
Name: Make, dtype: object

In [61]:
df_test.Make

0    Nissan
Name: Make, dtype: object

In [62]:
df.reset_index(drop=True)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
0,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee
1,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
2,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
4,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb

In [63]:
df = df.reset_index(drop=True)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
0,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee
1,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
2,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
4,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb

# Element wise operation

In [65]:
df['Engine HP']

0    261.0
1    218.0
2    138.0
3    194.0
4      NaN
Name: Engine HP, dtype: float64

In [66]:
df['Engine HP'] * 2

0    522.0
1    436.0
2    276.0
3    388.0
4      NaN
Name: Engine HP, dtype: float64

In [67]:
df.Year

0    2017
1    2010
2    1991
3    2017
4    2017
Name: Year, dtype: int64

In [68]:
df.Year > 2000

0     True
1     True
2    False
3     True
4     True
Name: Year, dtype: bool

In [69]:
df.Make == 'Nissan'

0     True
1    False
2     True
3    False
4    False
Name: Make, dtype: bool

In [71]:
# We can combine multiple expressions with "and" or "or"
(df.Year > 2000) & (df.Make == 'Nissan')

0     True
1    False
2    False
3    False
4    False
dtype: bool

# Filtering form dataframe

In [72]:
df[df.Make == 'Nissan']

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
0,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee
2,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa

In [73]:
df[(df.Year > 2000) & (df['Transmission Type']=='AUTOMATIC')]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,test_col
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
4,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb

# String Operation with dataframe

In [74]:
df['Vehicle_Style']

0         Pickup
1    convertible
2          sedan
3        4dr SUV
4          Sedan
Name: Vehicle_Style, dtype: object

In [75]:
df['Vehicle_Style'].str.lower()

0         pickup
1    convertible
2          sedan
3        4dr suv
4          sedan
Name: Vehicle_Style, dtype: object

In [76]:
df['Vehicle_Style'].str.replace(' ', '_')

0         Pickup
1    convertible
2          sedan
3        4dr_SUV
4          Sedan
Name: Vehicle_Style, dtype: object

In [77]:
df['Vehicle_Style'].str.lower().str.replace(' ', '_')

0         pickup
1    convertible
2          sedan
3        4dr_suv
4          sedan
Name: Vehicle_Style, dtype: object

In [78]:
df.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP', 'test_col'],
      dtype='object')

In [79]:
df.columns.str.lower().str.replace(' ', '_')

Index(['make', 'model', 'year', 'engine_hp', 'engine_cylinders',
       'transmission_type', 'vehicle_style', 'msrp', 'test_col'],
      dtype='object')

In [80]:
df.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP', 'test_col'],
      dtype='object')

In [81]:
df.columns = df.columns.str.lower().str.replace(' ', '_') # change is now stable

In [82]:
df.columns

Index(['make', 'model', 'year', 'engine_hp', 'engine_cylinders',
       'transmission_type', 'vehicle_style', 'msrp', 'test_col'],
      dtype='object')

In [83]:
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp,test_col
0,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee
1,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
2,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
4,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb

In [84]:
df.dtypes

make                  object
model                 object
year                   int64
engine_hp            float64
engine_cylinders       int64
transmission_type     object
vehicle_style         object
msrp                   int64
test_col              object
dtype: object

In [85]:
df.dtypes == 'object'

make                  True
model                 True
year                 False
engine_hp            False
engine_cylinders     False
transmission_type     True
vehicle_style         True
msrp                 False
test_col              True
dtype: bool

In [86]:
df.dtypes[df.dtypes == 'object']

make                 object
model                object
transmission_type    object
vehicle_style        object
test_col             object
dtype: object

In [87]:
df.dtypes[df.dtypes == 'object'].index

Index(['make', 'model', 'transmission_type', 'vehicle_style', 'test_col'], dtype='object')

In [88]:
list(df.dtypes[df.dtypes == 'object'].index)

['make', 'model', 'transmission_type', 'vehicle_style', 'test_col']

In [89]:
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp,test_col
0,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,ee
1,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,cc
2,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,dd
4,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,bb

In [90]:
df.transmission_type = df.transmission_type.str.lower()
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp,test_col
0,Nissan,Frontier,2017,261.0,6,manual,Pickup,32340,ee
1,Lotus,Elise,2010,218.0,4,manual,convertible,54990,cc
2,Nissan,Stanza,1991,138.0,4,manual,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,automatic,4dr SUV,34450,dd
4,Hyundai,Sonata,2017,NaN,4,automatic,Sedan,27150,bb

# Summarizing operation - EDA

In [91]:
df.msrp

0    32340
1    54990
2     2000
3    34450
4    27150
Name: msrp, dtype: int64

In [94]:
df.msrp.max()

54990

In [95]:
df.msrp.min()

2000

In [96]:
df.msrp.mean()

30186.0

In [97]:
df.msrp.sum()

150930

In [98]:
df.msrp.std()

18985.044903818372

In [99]:
df.msrp.count()

5

In [100]:
df.msrp.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: msrp, dtype: float64

In [101]:
df.describe()

              year  engine_hp  engine_cylinders          msrp
count     5.000000    4.00000          5.000000      5.000000
mean   2010.400000  202.75000          4.400000  30186.000000
std      11.260551   51.29896          0.894427  18985.044904
min    1991.000000  138.00000          4.000000   2000.000000
25%    2010.000000  180.00000          4.000000  27150.000000
50%    2017.000000  206.00000          4.000000  32340.000000
75%    2017.000000  228.75000          4.000000  34450.000000
max    2017.000000  261.00000          6.000000  54990.000000

In [102]:
df.describe().round(2)

          year  engine_hp  engine_cylinders      msrp
count     5.00       4.00              5.00      5.00
mean   2010.40     202.75              4.40  30186.00
std      11.26      51.30              0.89  18985.04
min    1991.00     138.00              4.00   2000.00
25%    2010.00     180.00              4.00  27150.00
50%    2017.00     206.00              4.00  32340.00
75%    2017.00     228.75              4.00  34450.00
max    2017.00     261.00              6.00  54990.00

In [103]:
df.make.nunique()

4

In [104]:
df.make.value_counts()

Nissan     2
Lotus      1
GMC        1
Hyundai    1
Name: make, dtype: int64

# Missing Value manage

In [105]:
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp,test_col
0,Nissan,Frontier,2017,261.0,6,manual,Pickup,32340,ee
1,Lotus,Elise,2010,218.0,4,manual,convertible,54990,cc
2,Nissan,Stanza,1991,138.0,4,manual,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,automatic,4dr SUV,34450,dd
4,Hyundai,Sonata,2017,NaN,4,automatic,Sedan,27150,bb

In [106]:
df.isnull()

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp,test_col
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,True,False,False,False,False,False

In [108]:
df.isnull().sum()

make                 0
model                0
year                 0
engine_hp            1
engine_cylinders     0
transmission_type    0
vehicle_style        0
msrp                 0
test_col             0
dtype: int64

In [109]:
df.engine_hp.isnull()

0    False
1    False
2    False
3    False
4     True
Name: engine_hp, dtype: bool

In [111]:
df.engine_hp.fillna(0)

0    261.0
1    218.0
2    138.0
3    194.0
4      0.0
Name: engine_hp, dtype: float64

In [114]:
df.engine_hp.fillna(df.engine_hp.mean())

0    261.00
1    218.00
2    138.00
3    194.00
4    202.75
Name: engine_hp, dtype: float64

In [115]:
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp,test_col
0,Nissan,Frontier,2017,261.0,6,manual,Pickup,32340,ee
1,Lotus,Elise,2010,218.0,4,manual,convertible,54990,cc
2,Nissan,Stanza,1991,138.0,4,manual,sedan,2000,aa
3,GMC,Acadia,2017,194.0,4,automatic,4dr SUV,34450,dd
4,Hyundai,Sonata,2017,NaN,4,automatic,Sedan,27150,bb

In [116]:
df.engine_hp = df.engine_hp.fillna(df.engine_hp.mean())

In [117]:
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp,test_col
0,Nissan,Frontier,2017,261.00,6,manual,Pickup,32340,ee
1,Lotus,Elise,2010,218.00,4,manual,convertible,54990,cc
2,Nissan,Stanza,1991,138.00,4,manual,sedan,2000,aa
3,GMC,Acadia,2017,194.00,4,automatic,4dr SUV,34450,dd
4,Hyundai,Sonata,2017,202.75,4,automatic,Sedan,27150,bb